/*
 * github의 gapminder.tsv 파일 다운로드, 테이블에 데이터 임포트.
 * TSV(tab-separated values): 값들이 탭으로 구분된 텍스트 파일. csv 파일의 일종.
 * 테이블 이름: gapminder
 * 컬럼 이름: country, continent, year, life_exp(기대수명), pop(인구수), gdp_percap(1인당 GDP)
 *
 * 1. 테이블에는 모두 몇 개의 나라가 있을까요?
 * 2. 테이블에는 모두 몇 개의 대륙이 있을까요?
 * 3. 테이블에는 저장된 데이터는 몇년도부터 몇년도까지 조사한 내용일까요?
 * 4. 기대 수명이 최댓값인 레코드(row)를 찾으세요.
 * 5. 인구가 최댓값인 레코드(row)를 찾으세요.
 * 6. 1인당 GDP가 최댓값인 레코드(row)를 찾으세요.
 * 7. 우리나라의 통계 자료만 출력하세요.
 * 8. 연도별 1인당 GDP의 최댓값인 레코드를 찾으세요.
 * 9. 대륙별 1인당 GDP의 최댓값인 레코드를 찾으세요.
 * 10. 연도별, 대륙별 인구수를 출력하세요.
 *     인구수가 가장 많은 연도와 대륙은 어디인가요?
 * 11. 연도별, 대륙별 기대 수명의 평균을 출력하세요.
 *     기대 수명이 가장 긴 연도와 대륙은 어디인가요?
 * 12. 연도별, 대륙별 1인당 GDP의 평균을 출력하세요.
 *     1인당 GDP의 평균이 가장 큰 연도와 대륙은 어디인가요?
 * 13. 10번 문제의 결과에서 대륙이름이 컬럼이 되도록 출력하세요.
 * 14. 11번 문제의 결과에서 대륙이름이 컬럼이 되도록 출력하세요.
 * 15. 12번 문제의 결과에서 대륙이름이 컬럼이 되도록 출력하세요.
 */
